'''
6. Сформировать (не программно) текстовый файл.
В нём каждая строка должна описывать учебный предмет и наличие лекционных,
практических и лабораторных занятий по предмету.
Сюда должно входить и количество занятий. Необязательно, чтобы для каждого предмета были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести его на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
'''


def create_dict():
    dict_lern = {}
    with open('my_file.txt', 'r') as f:
        for line in f:
            arg1, arg2, arg3, arg4 = line.split()
            dict_lern[arg1] = int(arg2.split('(')[0].isdigit()) + int(arg3.split('(')[0].isdigit()) + int(
                arg4.split('(')[0].isdigit())
        f.close()
    print(dict_lern)


if __name__ == '__main__':
    create_dict()
